#pragma once

//------------------------------------------------------------------------
// WinAPI 헤더
//------------------------------------------------------------------------
#define WIN32_LEAN_AND_MEAN		// <window.h>에서 불필요한 Windows API 생략 
#define NOMINMAX				// <windows.h>이 min, max 매크로를 정의하지 않음

#include <windows.h>

//------------------------------------------------------------------------
// DirectX 11 관련 헤더
//------------------------------------------------------------------------
#include <d3d11.h>				// DirectX 11 핵심 API
#include <dxgi.h>				// SwapChain, Adapter, Display 관련 API
#include <d3dcompiler.h>		// HLSL Shader 컴파일 API
#include <DirectXMath.h>		// Vector, Matrix 계산용 수학 라이브러리

//------------------------------------------------------------------------
// ComPtr 헤더
//------------------------------------------------------------------------
#include <wrl/client.h>

//------------------------------------------------------------------------
// C++ 표준 라이브러리
//------------------------------------------------------------------------
#include <cstdint>				// 고정 크기 정수 자료형 제공
#include <memory>				// 스마트 포인터 제공
#include <string>				// 문자열 클래스 제공
#include <vector>				// 동적 크기 배열 컨테이너 제공
#include <array>				// 고정 크기 배열 컨테이너 제공
#include <chrono>				// 시간 측정 도구 제공
#include <cassert>				// 조건 검증 기능 제공
#include <stdexcept>			// 표준 예외 클래스 제공